import React from "react";
import { FAQItem } from "@/app/components";

function Faq({type = "home"}: {type?: "home" | "contentus" | "tickets" | "hotels"}) {
  const faq = () => {
    if(type === "home"){
      return [
        {
          question: "آیا می‌توانم مقصد را خودم انتخاب کنم؟",
          answer: "بله، شما می‌توانید مقصد سفر را بر اساس سلیقه و نیاز خود تنظیم کنید.",
        },
        {
          question: "چند وقت قبل از سفر؛ باید در سایت اقدام کنیم؟",
          answer: "حداقل از یک ماه قبل از سفر نسبت به تهیه پکیج خود اقدام کنید.",
        },
        {
          question: "آیا این سرویس برای سفرهای داخلی و خارجی کاربرد دارد؟",
          answer: "بله پیشنهادات ما هم برای پکیج سفر داخلی و هم پکیج سفر خارجی می باشد.",
        },
        {
          question: "آیا قیمت‌های ارائه شده در سایت تضمینی و به‌روز هستند؟",
          answer: "بله، قیمت‌های ارائه شده در سایت همیشه دقیق و به‌روز باشند.",
        },
        {
          question: "آیا بلیط هواپیما هم رزرو میکنید؟",
          answer: "بله، ما علاوه بر برنامه‌ریزی کامل سفر، امکان رزرو بلیط هواپیما را نیز برای شما فراهم می‌کنیم. با همکاری با شرکت‌های معتبر، بهترین پروازها را متناسب با بودجه و زمان سفر شما انتخاب و رزرو می‌کنیم تا سفرتان از ابتدا تا انتها بی‌دغدغه باشد.",
        },
      ];
    }
    if(type === "contentus"){
      return [
        {
          question: "چگونه می‌توانم با تیم پشتیبانی در تماس باشم؟",
          answer: "شما می‌توانید از طریق شماره تلفن، ایمیل یا پیام در شبکه‌های اجتماعی با ما در ارتباط باشید.",
        },
        {
          question: "ساعات پاسخ‌گویی پشتیبانی چه زمانی است؟",
          answer: "تیم پشتیبانی آرون تراول به‌صورت ۲۴ ساعته، در تمام روزهای هفته پاسخ‌گوی شماست.",
        },
        {
          question: "چقدر طول می‌کشد تا پاسخ پیام من داده شود؟",
          answer: "ما تلاش می‌کنیم در کوتاه‌ترین زمان ممکن (معمولاً کمتر از چند دقیقه) به پیام‌ها پاسخ دهیم.",
        },
        {
          question: "اگر بعد از خرید بلیط یا دریافت پلن سفر مشکلی داشتم، از چه طریقی پیگیری کنم؟",
          answer: "کافی است از طریق تماس تلفنی، پلن سفر خود را اعلام کنید تا تیم ما بلافاصله پیگیری کند.",
        },
        {
          question: "آیا امکان ملاقات حضوری با تیم آرون تراول وجود دارد؟",
          answer: "بله آدرس ما خیابان سعادت آباد- بلوار سرو غربی- بعد ا خیابان مروارید- پلاک33- ساختمان سرو سبز- طبقه 4 واحد 19 می باشد.",
        },
      ];
    }
    if(type === "tickets"){
      return [
        {
          question: "چگونه می‌توانم بلیط هواپیما را رزرو کنم؟",
          answer: "با وارد کردن بودجه خود، سیستم ما بهترین گزینه‌های پروازی را به شما نشان می‌دهد تا بتوانید به خرید بلیط هواپیما اقدام کنید.",
        },
        {
          question: "آیا امکان استرداد یا تغییر بلیط هواپیما وجود دارد؟",
          answer: "بله، امکان استرداد آنلاین و تغییر بلیط مطابق قوانین ایرلاین‌ها وجود دارد و شما می‌توانید به راحتی این درخواست‌ها را ثبت کنید.",
        },
        {
          question: "آیا بلیط‌های چارتر و سیستمی موجود هستند؟",
          answer: "بله، ما هر دو نوع بلیط چارتر و سیستمی را پوشش می‌دهیم تا انتخاب‌های بیشتری برای شما فراهم کنیم.",
        },
        {
          question: "چه عواملی بر قیمت بلیط هواپیما تاثیرگذار هست؟",
          answer: "قیمت بلیط هواپیما به زمان رزرو، فصل سفر، نوع بلیط و کلاس پروازی بستگی دارد. همچنین میزان تقاضا و تخفیف‌های ایرلاین‌ها در تعیین قیمت تاثیرگذار هستند.",
        },
        {
          question: "مزایای خرید بلیط هواپیما از آرون تراول چیست؟",
          answer: "بر اساس بودجه شما، بهترین بلیط هواپیما و برنامه سفر به‌صورت هوشمند و دقیق برایتان انتخاب می‌شود.",
        },
      ];
    }
    if(type === "hotels"){
      return [
        {
          question: "چگونه می‌توانم بهترین هتل را متناسب با بودجه‌ام پیدا کنم؟",
          answer: "آرون تراول با استفاده از فناوری هوشمند، هتل‌هایی متناسب با بودجه و سلیقه شما پیشنهاد می‌دهد.",
        },
        {
          question: "آیا امکان کنسلی یا تغییر رزرو هتل وجود دارد؟",
          answer: "بله، شرایط کنسلی و تغییر رزرو بستگی به سیاست‌های هر هتل دارد که در زمان رزرو به شما اطلاع داده می‌شود.",
        },
        {
          question: "آیا قیمت‌های اعلام شده شامل تمامی هزینه‌ها است؟",
          answer: "بله، قیمت‌های ما کاملاً شفاف بوده و هیچ هزینه پنهانی ندارد.",
        },
        {
          question: "چگونه می‌توانم امکانات و خدمات هر هتل را مشاهده کنم؟",
          answer: "تمامی امکانات و خدمات هتل‌ها در صفحه رزرو به‌صورت کامل و دقیق نمایش داده می‌شود",
        },
        {
          question: "آیا پشتیبانی در زمان رزرو و اقامت هتل وجود دارد؟",
          answer: "بله، تیم پشتیبانی آرون تراول در تمام مراحل رزرو و اقامت همراه شماست تا هرگونه مشکل را برطرف کند.",
        },
      ];
    }
    return [];
  };
  const faqContent = faq();
  return (
    <div className="flex flex-col md:items-center items-start px-5 w-full">
      <div className="flex flex-col gap-4 md:items-center justify-center">
        <div className="flex items-center gap-6">
          <span className="i-fluent:chat-bubbles-question-16-filled h-8 w-8 hidden md:block"></span>
          <h2 className="md:text-2xl text-xl font-bold">سوالات متداول</h2>
        </div>
      </div>
      <div className="mt-12 flex flex-col gap-4 md:w-3/4 w-full">
        {faqContent.map((item, index) => (
          <FAQItem
            key={index}
            question={item.question}
            answer={item.answer}
          />
        ))}
      </div>
    </div>
  );
}

export { Faq };
